"""
Ответы на вопросы на тему: "Коммиты".
"""

# Опишите своими словами назначение каждого из этих типов коммитов:
# feat, fix, docs, style, refactor, test, build, ci, perf, chore.
#     feat - новая фича
#     fix - фикс чего-нибудь
#     docs - изменения какие-нибудь которые связаны с документацией
#     style - изменения в стиле написания кода
#     refactor - изменения куска код (напр, убрали логику какую-то)
#     test - добавили юнит тестыб кусок кода тестируют
#     build - новый билд собрали
#     ci - интеграция с другими продуктами
#     perf - что-то связанное с производительностью
#     chore - наводят порядки в каком то модуле

# Представьте, что вы исправили баг в функции, которая некорректно округляет числа.
# Сделайте фиктивный коммит и напишите для него сообщение в соответствии с Conventional Commits (используя тип fix).
# fix(round): correct logic in function CalCul

# Добавление новой функциональности:
# Допустим, вы реализовали новую функцию generateReport в проекте.
# Сделайте фиктивный коммит с типом feat, отражающий добавление этой функциональности
# feat(calculation): add new function generateReport in CalCulus module

# Модификация формата кода или стилей:
# Представьте, что вы поправили отступы и форматирование во всём проекте, не меняя логики кода.
# Сделайте фиктивный коммит с типом style
# style(format): apply formatting across all code

# Документация и тестирование:
# Сделайте фиктивный коммит с типом docs, добавляющий или улучшающий документацию для вашей новой функции.
# Сделайте фиктивный коммит с типом test, добавляющий тесты для этой же функции.
# docs(calculation): add new documentation to CalCul module
# test(calculation): add unit tests to CalCul module